//
//  Constances.swift
//  NewsTest
//
//  Created by boredarthur on 18.01.2022.
//

import Foundation

struct Constants {
    
    // MARK: - Constants related to API
    struct API {
        // MARK: - API key for NewsAPI
        static let apiKey: String = "487c8c4c7362490da73cc7b1c3315c76"
    }
    
    // MARK: - Constants for pickers
    struct Pickers {
        static let countiresDictionary = [
            "🇦🇪": "ae",
            "🇦🇷": "ar",
            "🇦🇹": "at",
            "🇦🇺": "au",
            "🇧🇪": "be",
            "🇧🇬": "bg",
            "🇧🇷": "br",
            "🇨🇦": "ca",
            "🇨🇭": "ch",
            "🇨🇳": "cn",
            "🇨🇴": "co",
            "🇨🇺": "cu",
            "🇨🇿": "cz",
            "🇩🇪": "de",
            "🇪🇬": "eg",
            "🇫🇷": "fr",
            "🇬🇧": "gb",
            "🇬🇷": "gr",
            "🇭🇰": "hk",
            "🇭🇺": "hu",
            "🇮🇩": "id",
            "🇮🇪": "ie",
            "🇮🇱": "il",
            "🇮🇳": "in",
            "🇮🇹": "it",
            "🇯🇵": "jp",
            "🇰🇷": "kr",
            "🇱🇹": "lt",
            "🇱🇻": "lv",
            "🇲🇦": "ma",
            "🇲🇽": "mx",
            "🇲🇾": "my",
            "🇳🇬": "ng",
            "🇳🇱": "nl",
            "🇳🇴": "no",
            "🇳🇿": "nz",
            "🇵🇭": "ph",
            "🇵🇱": "pl",
            "🇵🇹": "pt",
            "🇷🇴": "ro",
            "🇷🇸": "rs",
            "🇿🇦": "sa",
            "🇸🇪": "se",
            "🇸🇬": "sg",
            "🇸🇮": "si",
            "🇸🇰": "sk",
            "🇹🇭": "th",
            "🇹🇷": "tr",
            "🇹🇼": "tw",
            "🇺🇦": "ua",
            "🇺🇸": "us",
            "🇻🇪": "ve"]
        static let countriesList = [
            "🇦🇪", "🇦🇷", "🇦🇹", "🇦🇺","🇧🇪","🇧🇬","🇧🇷","🇨🇦","🇨🇭","🇨🇳","🇨🇴","🇨🇺","🇨🇿","🇩🇪","🇪🇬","🇫🇷","🇬🇧","🇬🇷","🇭🇰","🇭🇺","🇮🇩","🇮🇪","🇮🇱","🇮🇳","🇮🇹","🇯🇵","🇰🇷","🇱🇹","🇱🇻","🇲🇦","🇲🇽","🇲🇾","🇳🇬","🇳🇱","🇳🇴","🇳🇿","🇵🇭","🇵🇱","🇵🇹","🇷🇴","🇷🇸","🇿🇦","🇸🇪","🇸🇬","🇸🇮","🇸🇰","🇹🇭","🇹🇷","🇹🇼","🇺🇦","🇺🇸","🇻🇪"]
    }
}
